<span style="color: red;">
 <center> Name Mohsin Arif AI & Machine Learning<br></span>
Email mohsinarif2009@gmail.com<br>
Title Purpose of Documents<br></center>

In [1]:
#loading Libraries
%pip install pandas

Requirement already satisfied: pandas in c:\users\ydo hello\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\ydo hello\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\ydo hello\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\ydo hello\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\ydo hello\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in c:\users\ydo hello\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [3]:
pd.read_csv('data.csv')

             Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
1           Azziz     Teacher      M   30.0    35000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
5            Aqsa   Scientist      F   22.0        NaN
6           Rafia     Analyst      F   29.0    20000.0
7           Samra   Scientist      F   26.0   115000.0
8            Eman    Engineer      F   28.0    35000.0
9        Abdullah     Teacher      M   55.0        NaN
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M    NaN    90000.0
12          Ahsan     trainer      M  156.0   110000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0
15         Qaisar   professor      M   20.0   170000.0
16          Wajid    Engineer      M   85.0   190000.0

In [9]:
#loading file
df=pd.read_csv ("datacsv")

print(df)

FileNotFoundError: [Errno 2] No such file or directory: 'datacsv'

In [12]:
#excle laybrary
%pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\ydo hello\appdata\local\programs\python\python313\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\ydo hello\appdata\local\programs\python\python313\lib\site-packages (from openpyxl) (2.0.0)
Note: you may need to restart the kernel to use updated packages.

In [ ]:
pd.read_excel('data.xlsx')
pd.read_excel('data.xlsx')
df = pd.read_excel('data.xlsx')
print(df)df = pd.read_excel('data.xlsx')

In [87]:
print (df)

             Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
1           Azziz     Teacher      M   30.0    35000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
5            Aqsa   Scientist      F   22.0        NaN
6           Rafia     Analyst      F   29.0    20000.0
7           Samra   Scientist      F   26.0   115000.0
8            Eman    Engineer      F   28.0    35000.0
9        Abdullah     Teacher      M   55.0        NaN
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M    NaN    90000.0
12          Ahsan     trainer      M  156.0   110000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0
15         Qaisar   professor      M   20.0   170000.0
16          Wajid    Engineer      M   85.0   190000.0

In [29]:
# display the 5 row
df.head(3)

      Name Designation Gender   Age    Salary
0  Mukhtar   Professor      M  37.0  115000.0
1    Azziz     Teacher      M  30.0   35000.0
2   Mohsin    Engineer      M  29.0   50000.0

In [30]:
df.tail(1)

     Name Designation Gender   Age    Salary
16  Wajid    Engineer      M  85.0  190000.0

In [31]:
df.loc[8:9]

       Name Designation Gender   Age   Salary
8      Eman    Engineer      F  28.0  35000.0
9  Abdullah     Teacher      M  55.0      NaN

In [34]:
df.describe()

             Age        Salary
count   16.00000  1.500000e+01
mean    48.68750  1.725333e+05
std     35.55975  3.713435e+05
min     20.00000  2.000000e+03
25%     27.50000  3.500000e+04
50%     30.00000  7.000000e+04
75%     61.75000  1.150000e+05
max    156.00000  1.500000e+06

In [ ]:
df.shape()

# selecting the row and colum

In [35]:
df.head(15)

             Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
1           Azziz     Teacher      M   30.0    35000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
5            Aqsa   Scientist      F   22.0        NaN
6           Rafia     Analyst      F   29.0    20000.0
7           Samra   Scientist      F   26.0   115000.0
8            Eman    Engineer      F   28.0    35000.0
9        Abdullah     Teacher      M   55.0        NaN
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M    NaN    90000.0
12          Ahsan     trainer      M  156.0   110000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0

In [36]:
df.head(1)

      Name Designation Gender   Age    Salary
0  Mukhtar   Professor      M  37.0  115000.0

# Selecting Colums

In [ ]:
df['Designation']

0     Professor
1       Teacher
2      Engineer
3       Analyst
4      Engineer
5     Scientist
6       Analyst
7     Scientist
8      Engineer
9       Teacher
10    professor
11     engineer
12      trainer
13      teacher
14      trainer
15    professor
16     Engineer
Name: Designation, dtype: object

# step select 2 colum

In [58]:



select_colum1 = df[['Name','Designation']]
print(select_colum1)

             Name Designation
0         Mukhtar   Professor
1           Azziz     Teacher
2          Mohsin    Engineer
3   Naveed Fatima     Analyst
4           Babar    Engineer
5            Aqsa   Scientist
6           Rafia     Analyst
7           Samra   Scientist
8            Eman    Engineer
9        Abdullah     Teacher
10          Mosib   professor
11          Ahmed    engineer
12          Ahsan     trainer
13          Wajid     teacher
14          Naeem     trainer
15         Qaisar   professor
16          Wajid    Engineer

# sowing the 3 colums

In [51]:
select_colum = df[['Name','Designation','Gender']]
print(select_colum)

             Name Designation Gender
0         Mukhtar   Professor      M
1           Azziz     Teacher      M
2          Mohsin    Engineer      M
3   Naveed Fatima     Analyst      F
4           Babar    Engineer      F
5            Aqsa   Scientist      F
6           Rafia     Analyst      F
7           Samra   Scientist      F
8            Eman    Engineer      F
9        Abdullah     Teacher      M
10          Mosib   professor      M
11          Ahmed    engineer      M
12          Ahsan     trainer      M
13          Wajid     teacher      M
14          Naeem     trainer      M
15         Qaisar   professor      M
16          Wajid    Engineer      M

# selecting a Rows

In [59]:
select_colum1.loc[4:5]

    Name Designation
4  Babar    Engineer
5   Aqsa   Scientist

In [62]:
df.isnull().sum()

Name           0
Designation    0
Gender         0
Age            1
Salary         2
dtype: int64

In [64]:
mohsin = df.drop(index=9)
print(mohsin)

             Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
1           Azziz     Teacher      M   30.0    35000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
5            Aqsa   Scientist      F   22.0        NaN
6           Rafia     Analyst      F   29.0    20000.0
7           Samra   Scientist      F   26.0   115000.0
8            Eman    Engineer      F   28.0    35000.0
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M    NaN    90000.0
12          Ahsan     trainer      M  156.0   110000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0
15         Qaisar   professor      M   20.0   170000.0
16          Wajid    Engineer      M   85.0   190000.0

In [71]:
mohsin1 = df.drop(index=[4,9])
print(mohsin1)

             Name Designation Gender    Age    Salary
0         Mukhtar   Professor      M   37.0  115000.0
1           Azziz     Teacher      M   30.0   35000.0
2          Mohsin    Engineer      M   29.0   50000.0
3   Naveed Fatima     Analyst      F   30.0   70000.0
5            Aqsa   Scientist      F   22.0       NaN
6           Rafia     Analyst      F   29.0   20000.0
7           Samra   Scientist      F   26.0  115000.0
8            Eman    Engineer      F   28.0   35000.0
10          Mosib   professor      M   60.0   70000.0
11          Ahmed    engineer      M    NaN   90000.0
12          Ahsan     trainer      M  156.0  110000.0
13          Wajid     teacher      M   67.0    2000.0
14          Naeem     trainer      M   80.0   16000.0
15         Qaisar   professor      M   20.0  170000.0
16          Wajid    Engineer      M   85.0  190000.0

In [ ]:
mohsin = df.drop(columns='Age')
print(mohsin)

             Name Designation Gender     Salary
0         Mukhtar   Professor      M   115000.0
1           Azziz     Teacher      M    35000.0
2          Mohsin    Engineer      M    50000.0
3   Naveed Fatima     Analyst      F    70000.0
4           Babar    Engineer      F  1500000.0
5            Aqsa   Scientist      F        NaN
6           Rafia     Analyst      F    20000.0
7           Samra   Scientist      F   115000.0
8            Eman    Engineer      F    35000.0
9        Abdullah     Teacher      M        NaN
10          Mosib   professor      M    70000.0
11          Ahmed    engineer      M    90000.0
12          Ahsan     trainer      M   110000.0
13          Wajid     teacher      M     2000.0
14          Naeem     trainer      M    16000.0
15         Qaisar   professor      M   170000.0
16          Wajid    Engineer      M   190000.0

In [76]:
mohsin = df.drop(columns=['Age','Designation'])
print(mohsin)

             Name Gender     Salary
0         Mukhtar      M   115000.0
1           Azziz      M    35000.0
2          Mohsin      M    50000.0
3   Naveed Fatima      F    70000.0
4           Babar      F  1500000.0
5            Aqsa      F        NaN
6           Rafia      F    20000.0
7           Samra      F   115000.0
8            Eman      F    35000.0
9        Abdullah      M        NaN
10          Mosib      M    70000.0
11          Ahmed      M    90000.0
12          Ahsan      M   110000.0
13          Wajid      M     2000.0
14          Naeem      M    16000.0
15         Qaisar      M   170000.0
16          Wajid      M   190000.0

# deal Missing VAlue

In [92]:
pd.read_excel('data.xlsx')
df = pd.read_excel('data.xlsx')
print(df)

             Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
1           Azziz     Teacher      M   30.0    35000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
5            Aqsa   Scientist      F   22.0        NaN
6           Rafia     Analyst      F   29.0    20000.0
7           Samra   Scientist      F   26.0   115000.0
8            Eman    Engineer      F   28.0    35000.0
9        Abdullah     Teacher      M   55.0        NaN
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M    NaN    90000.0
12          Ahsan     trainer      M  156.0   110000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0
15         Qaisar   professor      M   20.0   170000.0
16          Wajid    Engineer      M   85.0   190000.0

In [94]:
df['Age'].isnull().sum()

np.int64(1)

In [107]:
df2=df['Age'].fillna(df['Age'].median())
print(df2)

0      37.0
1      30.0
2      29.0
3      30.0
4      25.0
5      22.0
6      29.0
7      26.0
8      28.0
9      55.0
10     60.0
11     30.0
12    156.0
13     67.0
14     80.0
15     20.0
16     85.0
Name: Age, dtype: float64

In [111]:
df.drop(index=[4:5])

SyntaxError: invalid syntax (1064876196.py, line 1)